Repository: pypi-data/pypi-mirror-398
Catalog: packages/aa-memberaudit-dc/aa_memberaudit_dc-0.3.3-py3-none-any.whl/madc/locale/*/LC_MESSAGES/django.po
Languages: de

source: Permission Denied
de: Zugriff verweigert

source: Delete Skill Plan
de: Lösche Skillplan

source: Are you sure you want to delete this skill plan?
de: Möchten Sie diesen Skill plan wirklich löschen?

source: Enter name
de: Name eingeben

source: Toggle active status
de: Aktiven Status umschalten

source: Enter ordering
de: Reihenfolge eingeben

source: Enter category
de: Kategorie eingeben

source: Active
de: Aktiv

source: Inactive
de: Inaktiv

source: Character not found in skill lists
de: Charakter nicht in der Skill liste gefunden

source: Doctrine Checker
de: Doktrin Prüfer

source: Skill list cannot be empty.
de: Skill Liste darf nicht leer sein.

source: Line {}: Skill name cannot be empty
de: Zeile {}: Der Name des Skills darf nicht leer sein

source: Line {}: '{}' - Invalid format. Use 'Skill Name Level' (Level 1-5) or EVE localized format
de: Zeile {}: ‚{}‘ – Ungültiges Format. Verwenden Sie „Skill Name Level“ (Level 1–5) oder das lokalisierte EVE-Format

source: A skill plan with the name '{}' already exists. Please choose a different name.
de: Ein Skill-Plan mit dem Namen „{}“ existiert bereits. Bitte wählen Sie einen anderen Namen.

source: {skill} is not a valid skill.
de: {skill} ist kein gültiger Skill.

source: {skill} level must be between 0 and 5.
de: {skill} Level muss zwischen 0 und 5 sein.

source: Please provide a valid skill list in JSON format.
de: Bitte geben Sie eine gültige Liste der Skills im JSON-Format an.

source: Order Weight
de: Reihenfolge Gewichtung

source: If unchecked, this skill list will not be used in the skill checker.
de: Wenn diese Option nicht aktiviert ist, wird diese Skill Liste nicht im Skill Prüfer verwendet.

source: Category
de: Kategorie

source: Category of the skill list, used for grouping.
de: Kategorie der Skill Liste, die zur Gruppierung verwendet wird.

source: Add Doctrine
de: Doktrin hinzufügen

source: Submit
de: Senden

source: Corporation Overview
de: Corporation Übersicht

source: Actions
de: Aktionen

source: Show
de: Zeige

source: Account Overview
de: Account Übersicht

source: All Categories
de: Alle Kategorien

source: Administration
de: Verwaltung

source: Doctrine Skills
de: Doktrin Skills

source: No data found...
de: Keine Daten gefunden...

source: Missing Skills
de: Fehlende Skills

source: Close
de: Schließen

source: Cancel
de: Abbrechen

source: Confirm
de: Bestätigen

source: Doctrines
de: Doktrinen

source: Character
de: Charakter

source: Order-Weight
de: Reihenfolge-Gewicht

source: Doctrine Administration
de: Doktrin Verwaltung

source: Your skill plan is empty. Please add skills.
de: Ihr Skill Plan ist leer. Bitte fügen Sie Skills hinzu.

source: Skill plan '{}' with {} skills saved successfully.
de: Skill Plan „{}“ mit {} Skills erfolgreich gespeichert.

source: There was an error with your skill plan:
de: Es ist ein Fehler bei Ihrem Skill-Plan aufgetreten:

source: There was an error with your skill plan. Please check the form and try again.
de: Es ist ein Fehler bei Ihrem Skill-Plan aufgetreten. Bitte überprüfen Sie das Formular und versuchen Sie es erneut.

source: There was an error processing your request. Please try again.
de: Bei der Bearbeitung Ihrer Anfrage ist ein Fehler aufgetreten. Bitte versuchen Sie es erneut.

source: Invalid Method
de: Ungültige methode

source: Skilllist: {skilllist_obj.name} deleted
de: Skill Liste: {skilllist_obj.name} gelöscht

source: Invalid request method
de: Ungültige anfragen methode

source: Skill list not found
de: Skill Liste nicht gefunden

source: Invalid field data
de: Ungültige Felddaten

source: An error occurred while updating
de: Beim Aktualisieren ist ein Fehler aufgetreten

source: Invalid field name
de: Ungültiger Feldname

source: Name cannot be empty
de: Name darf nicht leer sein

source: Skill list with this name already exists
de: Skill Liste mit diesem Namen existiert bereits

source: Name updated successfully
de: Name erfolgreich aktualisiert

source: Invalid active value
de: Ungültiger aktiver Wert

source: Active status updated successfully
de: Aktiver Status erfolgreich aktualisiert

source: Ordering must be between 0 and 999
de: Die Reihenfolge muss zwischen 0 und 999 liegen

source: Ordering updated successfully
de: Reihenfolge erfolgreich aktualisiert

source: Ordering must be a valid number
de: Die Bestellung muss eine gültige Nummer sein

source: Category cannot be empty
de: Kategorie darf nicht leer sein

source: Category updated successfully
de: Kategorie erfolgreich aktualisiert
