SKIP = {" ", "","၊", "။", ",", "?", "!"}
PUNCT_WT_ENDING = {" ", "", ",", "?", "!"}

FUN_TAG = {"PRED", "NUM", "NUMCL", "CONJ", "POSTP", "NOUNCL", "PRN",
            "MCONJ", "INUMCL", "DAYCL", "MONTHCL", "REGIONCL", 
            'REGION', 'MONTH', 'DAY', 'REG', 'SWORD', 'TITLE',   
            'ORG', 'NAME', 'PARLI', 'DATE', 'TIME', 'EMAIL', 'URL'}

NEG_SENT_SFP = ("ပါ", "ဘူး", 'နဲ့', 'နှင့်')   
QUE_SENT_SFP = ("နည်း", 'လား', 'ရှိလား','လဲ', 'ပါလဲ','တုံး')
NEG_PREFIX = "မ"

ISOLATED_SFP_TO_POSTP = ('ပြီ', '၏', 'စေ', 'သည်', 'ပါ')
SPECIAL_POSTP = ("ကို", "က", "မှာ", "ရော", "အား")
SPECIAL_NUM = "နှစ်"

SPECIAL_ADJ = ('သော', 'သည့်', 'သည့်', 'မည့်', '၍', 'ရန်')
SPECIAL_POSTP_SFP = ('၏', 'သည်', 'မည်')
PERCENT_WORD = "ရာခိုင်နှုန်း"
COMMON_KEYS_PRE = ('ဦး', 'ရက်', 'ပင်')
DAY_CL = ('နေ့', 'ရက်')
MTH_CL =  ("လ", "လကုန်", "လပိုင်း", "လလယ်", "လဆန်း")
PNUM_CL = ('အကြိမ်', 'အနှစ်', 'အသက်', 'အချက်', 'ဒေါ်လာ')
NOUN_CL = ('များ', 'အများ','များစွာ','တို့', 'တွေ', 'အသင်း', 'အဖွဲ့', 
           'အဖွဲ့အစည်း', 'အစု', 'အုပ်စု', 'ဌာန', 'ဌာနခွဲ', 'ကောင်စီ', 'ကာလ',
           'ပွဲတော်')
REGION_CL = ('ခရိုင်','မြို့နယ်','တိုင်းဒေသကြီး','ဒေသ','ပြည်နယ်','နိုင်ငံ',
 'ကျေးရွာ','ရပ်ကွက်','မြို့ပြ','မြို့တော်','မြို့နယ်ခွဲ','မြို့တော်ကြီး',
 'ဒေသ','မြောက်ပိုင်း','တောင်ပိုင်း','အရှေ့ပိုင်း','အနောက်ပိုင်း','အလယ်ပိုင်း',
 'မြို့တ၀ိုက်','ကမ်းခြေ', 'တူးမြောင်း','မြစ်ဝှမ်း', 'တောင်တန်း')
REGION_ONE_WORD = ('တောင်','ရွာ','မြို့','မြစ်', 'ချောင်း', 'တိုင်း')