#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Project      : AI.  @by PyCharm
# @File         : idphoto_types
# @Time         : 2024/9/3 12:24
# @Author       : betterme
# @WeChat       : meutils
# @Software     : PyCharm
# @Description  : 

from meutils.pipe import *

SIZES = {
    "一寸": "413,295",
    '二寸': '626,413',
    '小一寸': '378,260',
    '小二寸': '531,413',
    '大一寸': '567,390',
    '大二寸': '626,413',
    '五寸': '1499,1050',
    '教师资格证': '413,295',
    '国家公务员考试': '413,295',
    '初级会计考试': '413,295',
    '英语四六级考试': '192,144',
    '计算机等级考试': '567,390',
    '研究生考试': '709,531',
    '社保卡': '441,358',
    '电子驾驶证': '378,260'
}

COLORS = {
    "蓝色": "86, 140, 212",
    "白色": "255, 255, 255",
    "红色": "233, 51, 35",
    "纯蓝色": "0, 0, 255",
    "道奇蓝": "30, 144, 255",
    "纯红色": "255, 0, 0",
    "猩红色": "220, 20, 60",

    "blue": "86, 140, 212",
    "white": "255, 255, 255",
    "red": "233, 51, 35",
}
