"""
使用统计方法计算指标

"""

import pandas as pd
import numpy as np
from tpf.data.deal import Data2Feature as dtf 
from tpf.conf import pc 

data_file_path = "/ai/data/jiaoyi/tra_selected_20251105.csv"
df=pd.read_csv(data_file_path)
pc.lg(f"1. df=\n{df[:3]}")
"""
[2025-11-05 16:27:59] 1. df=
          id11         id12       time8        amt  balance  cat1  cat2  cat3               time14
0  A0000000041  A0000000080  2025-12-04   87167.57  51357.0  9004    99    12  2025-12-04 23:11:13
1  A0000000064  A0000000127  2025-11-11  125599.55  52714.0  9004    99    12  2025-11-11 14:22:26
2  A0000000087  A0000000174  2025-10-19  163040.75  54071.0  9004    99    12  2025-10-19 21:33:39
"""

"""
什么是业务分类？
1. 类别列的不同的值就是业务分类，比如cat1列中值为9004的行就是业务分类1、9005的行就是业务分类2
2. 分类可以相互组合，
   2.1 比如业务分类1和分类2组合就是业务分类1+分类2，因为来自同一列这种分类是或的逻辑关系
   2.2 比如cat1列中值为9004与cat2列中值为99的行就是业务分类1+分类2,因为来自不同的列这种分类是且的逻辑关系
"""






