Repository: pypi-data/pypi-mirror-398
Catalog: packages/mac-cleaner/mac_cleaner-1.1.0-py3-none-any.whl/mac_cleaner/locales/*/LC_MESSAGES/mac_cleaner.po
Languages: es_es

source: Critical system path
es_es: Ruta crítica del sistema

source: Contains critical system paths
es_es: Contiene rutas críticas del sistema

source: Protected system file
es_es: Archivo protegido del sistema

source: Outside safe deletion zones
es_es: Fuera de zonas seguras para eliminar

source: WARNING
es_es: ADVERTENCIA

source: Skipping protected path
es_es: Saltando ruta protegida

source: Scanning
es_es: Escaneando

source: Temporary Files
es_es: Archivos Temporales

source: System and app temporary files
es_es: Archivos temporales del sistema y aplicaciones

source: System Log Files
es_es: Archivos de Log del Sistema

source: System and application logs
es_es: Logs del sistema y aplicaciones

source: Homebrew Cache
es_es: Caché de Homebrew

source: Homebrew caches and downloads
es_es: Cachés y descargas de Homebrew

source: Browser Cache
es_es: Caché de Navegadores

source: Web browser caches
es_es: Cachés de navegadores web

source: node_modules found in projects
es_es: node_modules encontrados en proyectos

source: User Cache Files
es_es: Archivos Caché de Usuario

source: User caches (excluding com.apple.*)
es_es: Cachés de usuario (excluyendo com.apple.*)

source: Development Cache
es_es: Caché de Desarrollo

source: Xcode, npm, pip, yarn caches, etc.
es_es: Cachés de Xcode, npm, pip, yarn, etc.

source: Docker Data
es_es: Datos de Docker

source: Unused Docker images and volumes
es_es: Imágenes y volúmenes no usados de Docker

source: Docker is not running. Cannot calculate reclaimable space.
es_es: Docker no está ejecutándose. No se puede calcular el espacio recuperable.

source: Selection
es_es: Selección

source: Invalid input.
es_es: Entrada inválida.

source: This tool is designed for macOS only.
es_es: Esta herramienta está diseñada solo para macOS.

source: Scanning categories...
es_es: Escaneando categorías...

source: No categories with data found.
es_es: No se encontraron categorías con datos.

source: Categories found:
es_es: Categorías encontradas:

source: Select categories (e.g., 1,3,5 or all)
es_es: Selecciona categorías (ej: 1,3,5 o all)

source: Nothing selected.
es_es: Nada seleccionado.

source: Summary
es_es: Resumen

source: Dry-run: nothing will be deleted.
es_es: Simulación: no se borrará nada.

source: Delete all of the above?
es_es: ¿Eliminar todo lo anterior?

source: Cancelled.
es_es: Cancelado.

source: Starting deletion...
es_es: Iniciando borrado...

source: SKIPPED
es_es: SALTADO

source: Docker is not running, will not execute docker system prune.
es_es: Docker no está corriendo, no se ejecutará docker system prune.

source: Executing docker system prune -af --volumes...
es_es: Ejecutando docker system prune -af --volumes...

source: Docker cleaned.
es_es: Docker limpiado.

source: Docker prune failed
es_es: Docker prune falló

source: Protected path
es_es: Ruta protegida

source: Permission denied
es_es: Permiso denegado

source: Protected by macOS
es_es: Protegido por macOS

source: Deleted
es_es: Borrado

source: Cleanup completed.
es_es: Limpieza completada.

source: Mac Cleaner - Safe disk cleaning utility for macOS
es_es: Mac Cleaner - Utilidad segura de limpieza de disco para macOS

source: Simulate without deleting anything
es_es: Simular sin borrar nada
