from .curveData import 基准出力曲线, 基准出力曲线2, 基准出力曲线3, 负荷曲线, 策略曲线, 运行策略曲线

extra_paths = {
    '光伏': 基准出力曲线,
    '光伏曲线': 基准出力曲线,
    '风机': 基准出力曲线,
    '风机曲线': 基准出力曲线,
    '燃气': 基准出力曲线2,
    '燃气曲线': 基准出力曲线,
    '水电': 基准出力曲线2,
    '水电曲线': 基准出力曲线,
    '火电': 基准出力曲线2,
    '火电曲线': 基准出力曲线,
    '生物质发电': 基准出力曲线2,
    '生物质发电曲线': 基准出力曲线,
    '垃圾电厂': 基准出力曲线2,
    '垃圾电厂曲线': 基准出力曲线,
    '负荷分类':  负荷曲线,
    '负荷用户':  负荷曲线,
    '储能运行策略': 运行策略曲线,
}

def getCurveData(kind):
    if kind in extra_paths:
        return extra_paths[kind]
    else :
        return []